#include <graphics.h>
#include <iostream>
using namespace std;
int main()
{
// реалните данни, които се изобразяват като вертикални стълбчета, се четат от файл или
//клавиатура или масив
float a[] = {5, 12, 18, 8, 13, 23, 14, 10};
//надписите, които ще са текст под всяко стълбче, се четат от файл или клавиатура или масив
char labels[][20]={"a", "b", "c", "d", "e", "f", "g", "h"};
int n=sizeof(a)/sizeof(a[0]);
int winwidth=800,winheight=600; // параметри на прозореца на графичната система
int Px=600,Py=400,D=50,Ds=40,Dc=30,x0=100,y0=450 ; //параметри на графичния прозорец, в който
//ще се изобразят данните (вътре в прозореца на графичната система)
int i,x1,y1,x2,y2;
//намиране на диапазона на изменение на данните
float amin = a[0];
float amax = a[0];
for(int i = 1; i< n; i++) {
if(a[i] < amin) amin = a[i];
if(a[i] > amax) amax = a[i];
}
if (amin>0) amin=0;// всички стойност са положителни, разширяваме диапазона до amin=0, за да
//може най-малкото стълбче да се види като стълбче, а не като отсечка върху скалата с надписите
if (amax<0) amax=0;// всички стойност са отрицателни, разширяваме диапазона до amax=0, за да
//може най-малкото стълбче да се види като стълбче, а не като отсечка върху оста с надписите
//определяне на скалния коефициент за скалата със стойностите(вертикалната)
float s = (amax - amin)/Py;
// определяне на новото положение на хоризонталната ос,за да може да се изобразяват само
//положителни, само отрицателни или смесени данни
int y0n=y0+amin/s;
// инициализация на графичната система чрез отваряне на графичен прозорец със зададен размер
initwindow(winwidth,winheight);
//изчертаване на графичния прозорец
line(x0,y0n,x0+Px,y0n);//хоризонтална ос
line(x0,y0,x0,y0-Py);//вертикална ос
int I = Py/D; // брой деления по скалата със стойностите
char text[10];
//изчертаване и надписване на деленията по оста със стойностите
for(i=0; i<=I; i++)
{
line(x0, y0-D*i, x0-3, y0-D*i);//изчертаване на деленията
gcvt(amin + i*D*s,3.2, text);//преобразуване на реалната стойност, съответстваща на делението в
//символен низ
settextjustify(2,1);
outtextxy(x0-10,y0-D*i+5, text); // извеждане на стойността, съответстваща на делението
}
//надписване на оста с надписите
for(i=1; i<=n; i++)
{
settextjustify(1,2);
outtextxy(x0+i*(Ds+Dc)-Ds/2,y0+5, labels[i-1]); // извеждане на надписите, съответстващи на
//данните
}
// изобразяване на стълбчетата, съответстващи на данните
for(i=1; i<n+1; i++)
{
x1=x0+i*(Ds+Dc)-Ds;// x координата на горен ляв ъгъл
y1=y0n-(a[i-1])/s; //y координата на горен ляв ъгъл
x2=x0+i*(Ds+Dc); // x координата на долен десен ъгъл
y2=y0n; // y координата на долен десен ъгъл
setfillstyle(1, i+1);
bar(x1,y1,x2,y2);
}
getch();
return 0;
}
