package tuvarna.leten2024.grupa2a.f22621663.FiniteAutomataProject.Terminal.CommandProcessor;
/**
 * Изброим тип CommandType, представляващ всички възможни команди.
 */
public enum CommandType {
    /**
     * Команда за отваряне на файл.
     */
    OPEN,

    /**
     * Команда за затваряне на файл.
     */
    CLOSE,

    /**
     * Команда за запазване на файл.
     */
    SAVE,

    /**
     * Команда за запазване на файл с ново име.
     */
    SAVEAS,

    /**
     * Команда за показване на помощна информация.
     */
    HELP,

    /**
     * Команда за изход от програмата.
     */
    EXIT,

    /**
     * Команда за показване на списък с налични команди.
     */
    LIST,

    /**
     * Команда за отпечатване на съдържанието на файл.
     */
    PRINT,

    /**
     * Команда за създаване на празен автомат.
     */
    EMPTY,

    /**
     * Команда за проверка дали автомат е детерминиран.
     */
    DETERMINISTIC,

    /**
     * Команда за разпознаване на дума чрез автомат.
     */
    RECOGNIZE,

    /**
     * Команда за създаване на автомат от регулярен израз.
     */
    REG,

    /**
     * Команда за запазване на автомат.
     */
    SAVEA,

    /**
     * Команда за обединение на два автомата.
     */
    UNION,

    /**
     * Команда за конкатенация на два автомата.
     */
    CONCAT,

    /**
     * Команда за създаване на позитивна обвивка на автомат.
     */
    UN,

    /**
     * Команда за проверка дали автомат е краен.
     */
    FINITE,

    /**
     * Команда за мутация на автомат.
     */
    MUTATOR;
}
