#include <graphics.h> // Включване на необходимите библиотеки за графики
#include <iostream>
using namespace std;

int main()
{
    // Реалните данни, които ще се изобразяват като вертикални стълбчета
    float a[] = {5, 12, 18, 8, 13, 23, 14, 10};

    // Надписите, които ще бъдат изобразени под всяко стълбче
    char labels[][20]={"a", "b", "c", "d", "e", "f", "g", "h"};

    int n = sizeof(a) / sizeof(a[0]); // Брой на данните

    // Параметри на графичния прозорец
    int winwidth = 800, winheight = 600;

    // Параметри за графичния прозорец, в който ще се изобразят данните
    int Px = 600, Py = 400, D = 50, Ds = 40, Dc = 30, x0 = 100, y0 = 450;

    int i, x1, y1, x2, y2; // Променливи за цикли и координати на стълбчетата

    // Намиране на диапазона на изменение на данните
    float amin = a[0], amax = a[0];
    for(int i = 1; i < n; i++) {
        if(a[i] < amin) amin = a[i];
        if(a[i] > amax) amax = a[i];
    }

    if (amin > 0) amin = 0; // Ако всички стойности са положителни, разширяваме диапазона
    if (amax < 0) amax = 0; // Ако всички стойности са отрицателни, разширяваме диапазона

    // Определяне на скалния коефициент за скалата със стойностите (вертикалната)
    float s = (amax - amin) / Py;

    // Определяне на новото положение на хоризонталната ос, за да може да се изобразят само
    // положителни, само отрицателни или смесени данни
    int y0n = y0 + amin / s;

    // Инициализация на графичната система чрез отваряне на графичен прозорец със зададен размер
    initwindow(winwidth, winheight);

    // Изчертаване на графичния прозорец
    line(x0, y0n, x0 + Px, y0n); // Хоризонтална ос
    line(x0, y0, x0, y0 - Py);   // Вертикална ос

    int I = Py / D; // Брой деления по скалата със стойностите

    // Изчертаване и надписване на деленията по оста със стойностите
    for(i = 0; i <= I; i++)
    {
        line(x0, y0 - D * i, x0 - 3, y0 - D * i); // Изчертаване на деленията
        char text[10];
        gcvt(amin + i * D * s, 3.2, text); // Преобразуване на реалната стойност в символен низ
        settextjustify(2, 1);
        outtextxy(x0 - 10, y0 - D * i + 5, text); // Извеждане на стойността, съответстваща на делението
    }

    // Надписване на оста с надписите
    for(i = 1; i <= n; i++)
    {
        settextjustify(1, 2);
        outtextxy(x0 + i * (Ds + Dc) - Ds / 2, y0 + 5, labels[i - 1]); // Извеждане на надписите, съответстващи на данните
    }

    // Изобразяване на стълбчетата, съответстващи на данните
    for(i = 1; i < n + 1; i++)
    {
        x1 = x0 + i * (Ds + Dc) - Ds;        // X координата на горния ляв ъгъл
        y1 = y0n - (a[i - 1]) / s;           // Y координата на горния ляв ъгъл
        x2 = x0 + i * (Ds + Dc);             // X координата на долния десен ъгъл
        y2 = y0n;                             // Y координата на долния десен ъгъл
        setfillstyle(1, i + 1);              // Задаване на цвят за стълбчето
        bar(x1, y1, x2, y2);                 // Изчертаване на стълбчето
    }

    getch(); // Задържане на екрана
    return 0; // Успешно изпълнение на програмата
}
